{"batchcomplete":true,"query":{"pages":[{"pageid":3099107,"ns":0,"title":"Yandex","extract":"Yandex N.V. (Russian: Яндекс) is a multinational corporation primarily for Russian and Russian-language users, providing 70 Internet-related products and services, including transportation, search and information services, e-commerce, navigation, mobile applications, and online advertising.The firm is registered in Schiphol, the Netherlands as a naamloze vennootschap (Dutch public limited company), but the company founders and most of the team members are located in Russia. It primarily serves audiences in Russia and the Commonwealth of Independent States, and also has 30 offices worldwide.The firm is the largest technology company in Russia and the second largest search engine on the Internet in Russian, with a market share of over 42%. It also has the largest market share of any search engine from Europe and  the Commonwealth of Independent States and is the 5th largest search engine worldwide after Google, Bing, Yahoo!, and Baidu.Its main competitors on the Russian market are Google, VK, and Rambler.\n\n\n== Offices ==\nYandex has offices in 10 countries. The company's technology and business development unit, Yandex Labs, was opened in Silicon Valley in 2008. The Istanbul office was launched together with the company's web portal in Turkey in 2011.The company opened its first European office in Lucerne in 2012 to serve advertising clients in the EU. Its first research and development office in Europe started operating in Berlin in 2014. The company's Shanghai office was launched in 2015 to facilitate work with Chinese companies operating on the Russian language market.A new location in Prague was added in December 2021 to accommodate the company's rapidly expanding crowdsourcing, routing, cloud computing, ridesharing and weather forecasting teams.\n\n\n== History ==\n\n\n=== Name ===\nIn 1993, Arkady Volozh and Ilya Segalovich, friends since their school days and by then working together to develop search software, invented the word \"Yandex\" to describe their search technologies. The name initially stood for \"Yet Another iNDEXer\". However, this is also a bilingual pun on \"index\" since \"Я\" (\"ya\") means \"I\" in Russian."}]}}